import tulu from "../assets/O01___A_1.png";
export const data = [
  {
    id: 0,
    name: "圖魯",
    charType: "傷害型",
    image: tulu,
    skill1: "打擊【1】",
    skill1Info:
      "造成 攻擊力*【10%/12%/14%/16%/18%/20%】點傷害. 圖魯獲得【6/7/8/9/10/11】點狂氣.",
    skill2: "防禦【1】",
    skill2Info:
      "獲得 防禦力*【10%/12%/14%/16%/18%/20%】點護盾. 圖魯獲得6點狂氣.",
    skill3: "不巧威儀【3】",
    skill3Info:
      "圖魯獲得【25/30/35/40/45/50】點狂氣. 靈知覺醒: 圖魯每消耗1點算力. 觸腕傷害+2",
    skill4: "深淵號令【4】",
    skill4Info:
      "對所有敵人造成 攻擊力*【30%/36%/42%/48%/54%/60%】點穿刺傷害. 使所有觸腕攻擊1次, 造成穿刺傷害.",
    skill5: "螺X重臨【3】",
    skill5Info:
      "驅散自身虛弱狀態.臨時觸腕傷害+ 攻擊力*【20%/24%/28%/32%/36%/40%】",
    breakthrough:
      " 暗夜呢喃\n-「深夜號令」使觸腕攻擊所有敵人.\n甦醒之觸\n-「打擊」和「防禦」使觸腕傷害臨時提高圖魯攻擊的3%.（效果隨「打擊」,「防禦」的等級提升)\n群星歸位\n「」提高15%臨時暴擊率.",
    skill:
      "打擊[1]\n 造成14點傷害. 圖魯獲得6點狂氣.\n防禦[1]\n獲得11點護盾. 圖魯獲得6點狂氣.\n不巧威儀[3]\n圖魯獲得30點狂氣.！靈氣覺醒: 圖魯每消耗1點算力,！觸腕傷害+2.",
  },
];
